# 1. 초기 UI를 위한 점자 아트 변수 리스트 지정
MONEY = ["╭─────────────────────────────────────────────────────────────────────────╮",
         "│ ███╗   ███╗ ██████╗ ███╗   ██╗███████╗██╗   ██╗          ╭────────────╮ │",
         "│ ████╗ ████║██╔═══██╗████╗  ██║██╔════╝╚██╗ ██╔╝          │   10,000   │ │",
         "│ ██╔████╔██║██║   ██║██╔██╗ ██║█████╗   ╚████╔╝           ├────────────┤ │",
         "│ ██║╚██╔╝██║██║   ██║██║╚██╗██║██╔══╝    ╚██╔╝            │ % CE  C del│ │",
         "│ ██║ ╚═╝ ██║╚██████╔╝██║ ╚████║███████╗   ██║             │ 7  8  9  × │ │",
         "│ ╚═╝     ╚═╝ ╚═════╝ ╚═╝  ╚═══╝╚══════╝   ╚═╝             │ 4  5  6  - │ │",
         "│                                                          │ 1  2  3  + │ │",
         "│                                                          │    0     = │ │",
         "│                                                          ╰────────────╯ │",
         "╰─────────────────────────────────────────────────────────────────────────╯"]

DEPOSIT = ["⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢟⠫⠍⠠⠍⠻⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡱⠉⠀⠀⠀⡀⠂⠹⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡘⢀⢈⡠⠡⡠⠅⢠⢡⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⡉⢉⠻⣿⣿⣿⣿⣿⣿⣿⡿⢉⠛⣿⣿⡇⡁⠀⡰⠁⠰⠁⢠⠒⣼⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⡉⠡⢀⠂⠌⡐⢀⠂⡐⢈⠻⣿⣿⣿⣿⡿⡅⢢⣌⣿⣿⣷⡀⠀⠀⢀⡠⠜⣡⣾⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⡉⠡⢀⠂⠌⡐⠠⢁⠂⠌⣐⡀⢦⠒⡬⣉⠖⣩⠻⣿⣿⡟⣠⢻⡼⣿⣿⣿⣿⣿⣬⣵⣶⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⡛⠩⢁⠂⡐⢈⠐⠠⢁⠂⠌⣐⡠⢅⠲⡌⠳⠤⡙⢤⠋⡔⢢⠍⡔⢣⡉⢟⠱⣱⠊⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⠿⠟⡛⠩⢁⠂⠌⡐⠠⢁⠂⡐⢀⢂⡌⠴⣂⢎⡹⢄⡚⠬⡱⢌⢣⢃⡍⠆⡭⢘⠢⢍⡒⡡⠜⢢⠈⢧⡘⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⠿⠛⢋⠉⠄⡈⠐⠠⢁⠂⠌⡐⢠⡁⠦⡔⡒⡍⢲⡈⢇⠲⠌⣆⠣⡜⡑⢦⡉⠖⡬⢰⠩⢔⡩⠜⢢⠌⡑⢎⡡⢓⠦⡍⢒⡹⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⡕⣌⠠⢈⠐⠠⢁⡂⡤⢌⠲⢌⠣⡜⢡⢒⡱⢌⠣⠜⡌⢣⠍⡔⢣⢌⡱⢢⡉⠞⡰⢡⠓⡬⢰⢉⠆⢎⡑⠦⣘⠢⢱⠨⢅⠢⡅⢢⢙⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⡄⠳⣄⠚⣌⠣⡜⡰⡉⢎⠬⡱⢌⠣⡜⡐⢎⡡⢋⡜⢢⡉⠖⡡⢆⡱⢂⠭⣘⢡⠣⢍⡔⢃⠎⡜⠢⢜⠒⡤⢋⠤⡓⠬⡑⠬⣁⠎⣒⢡⣊⣽⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣅⠌⠳⣌⠒⡥⢒⡩⢆⢃⠖⡡⢃⡒⢍⠢⡅⢣⡘⢆⡡⡙⠴⠨⡔⣉⠦⡑⢢⠍⠦⣘⢡⠚⣌⠱⡊⡜⢄⢣⠚⣐⢣⢉⠖⡁⢊⠚⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣎⠡⢌⠳⣐⠣⢔⢊⡌⠲⣁⠧⡘⡌⡱⠨⡅⢜⡐⢢⢑⡊⢕⡰⢌⢢⠙⠤⠊⠑⠤⢃⠎⠤⣃⠱⢌⡊⢤⠙⡄⠦⡁⠎⡐⢂⣰⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣖⠠⠃⡌⠳⣌⠒⡬⢑⠢⢒⡡⢒⢡⢃⠜⠢⡌⠥⠒⠌⠆⠒⠈⣀⠠⢄⡒⠸⣈⠆⣩⠒⡌⠜⢢⠘⡄⠣⠘⡀⢁⠀⠀⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣆⠱⡈⠔⡈⠓⡜⢬⣁⠣⠔⡉⢆⡌⢊⡑⠈⢀⡁⠤⡐⢊⠱⣀⢣⢂⡜⢡⠒⡌⢄⠣⠘⡈⠄⠡⢀⠁⢂⠐⣀⣤⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣆⠑⢢⠁⢃⡘⢄⠊⡕⢪⢑⠢⢌⡡⠜⡉⢆⡘⡄⢣⢉⡒⢌⠂⢆⠘⠄⠡⠈⠄⢂⠡⠐⢈⠐⠠⠈⠀⢈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣎⠄⡉⠆⡐⠂⢅⠘⠠⢃⠍⡂⠦⡑⡘⠤⢂⠱⡈⠆⠈⠄⡉⠄⡈⠄⠡⢈⠐⡀⠂⠌⠠⢈⠐⣠⣡⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠌⡐⠡⠌⡀⠊⠔⠠⢈⠐⠁⠂⠡⠘⠠⢁⠐⡈⠐⠠⠐⠠⠐⡈⠐⡀⠂⢄⣡⣬⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠄⠃⠌⠄⡁⠌⠐⠠⢈⠂⡁⢂⠁⠂⠄⠂⠄⡁⢂⠁⢂⢡⣠⣵⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠡⢈⠐⠄⠂⠌⠀⠂⠐⡀⠂⠌⡐⢈⠐⣠⣴⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠠⠈⠄⠡⠈⠄⡁⠂⢄⣁⣦⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠡⠈⢄⣡⣦⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
           "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿"]

YOUTH_ACC = ["⣿⢿⢿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
             "⣿⣿⣽⡹⡿⣿⣿⣿⣿⡪⣗⣝⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
             "⣿⣿⣿⣾⢵⢝⡽⣻⣿⣮⣗⣵⡿⢟⠫⣑⣾⣿⣿⣿⡯⣫⢞⢮⠯⡟⡮⣿⡯⡫⣿⣿⣝⡽⣪⣿⡿⡭⣫⣝⣭⣫⣝⣿⡿⣫⣳⢝⡿⣟⢮⡻⣿⣑⢕⢍⠧⡱⡱⢱⣿⡕⡕⢕⢕⢽⢸⢨⣿",
             "⣿⣿⣿⣿⣿⡪⣞⣕⢗⣿⢋⠕⢌⢢⢑⣾⣿⣿⣿⣿⡿⡯⡺⣝⢯⡯⣺⣻⡯⡫⡿⡷⡵⣝⢮⣿⣟⢮⣻⣿⣿⣿⣿⣿⣝⢮⢿⡳⣝⣗⢗⡽⣿⣿⢕⢜⢬⠪⡪⡪⣿⡟⢕⢱⠸⣻⢱⢑⢿",
             "⣿⣿⣿⣿⢯⡺⣕⢮⣳⡟⢔⢑⡑⣌⣾⣿⣿⣿⣿⣿⣾⣾⢿⢾⢵⢯⢮⣿⣯⣯⣮⣷⣽⡮⡳⣿⣯⣧⣧⣧⣳⣪⣮⣿⣿⣷⣽⣾⣾⣷⡽⣾⣿⣿⢕⢜⡔⢕⢇⢝⣷⣕⣵⠿⣮⣪⡢⡣⣾",
             "⣿⣿⣿⢯⡳⣹⣪⣳⣿⣑⠱⡰⠨⡺⣿⣿⣿⣿⣿⣿⡿⣕⢯⣯⣷⡝⣝⣿⣿⡪⡮⡿⡿⡿⡿⡿⡿⡿⡷⣣⢯⢿⢿⢿⢿⣻⡻⣫⢯⡺⣪⢿⣿⠱⣑⣾⡕⢕⢕⢕⣿⢝⠕⡕⢍⢏⢪⢸⣿",
             "⣿⣿⢯⣳⣽⣾⣿⣿⣿⣿⣷⣮⣊⢢⢙⢿⣿⣿⣿⣿⣿⣾⣵⣳⣵⣽⣾⣿⣿⣮⣷⣽⣽⣮⣷⣽⣮⣷⣽⣮⣷⣽⣵⣯⣾⣶⣿⣾⣿⣯⣾⣽⣿⣿⣿⣿⣧⣧⣧⣵⣿⣿⣿⣾⣿⣿⣼⣴⣿",
             "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣮⣂⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
             "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣼⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿"]

YOUTH_F_ACC = ["⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⣅⣅⢅⠅⠅⠅⠅⠅⠅⢅⢅⢅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅",
               "⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⣹⠊⠌⢝⡎⠌⠌⠌⠌⢜⢕⠡⠹⡌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌",
               "⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠙⢧⢥⢗⠃⠅⠅⠅⠅⡑⠵⡌⠮⠊⠌⠌⠌⠌⠌⢌⢌⢎⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌",
               "⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⢡⡅⠅⠅⣅⢵⢴⢴⢴⣨⠨⠨⠨⡐⡤⡕⡬⡬⣨⠨⠨⠨⡨⡨⠀⢏⠺⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨",
               "⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠠⠙⡷⣝⠊⠅⡂⡂⡂⠌⡛⡧⣣⢋⢐⢐⢐⢐⠨⠹⡸⡜⡊⠄⠅⡂⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌",
               "⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⡱⡏⠹⣮⢐⢐⢐⠠⢁⢢⢋⠺⣆⢂⢂⢂⠂⠌⡜⠎⢳⠄⠅⠅⡂⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅",
               "⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⡿⡠⠡⣹⠆⡂⡂⠌⡐⣝⢐⠈⣷⢐⢐⢐⠨⠸⡌⠌⢄⢯⠨⢐⠠⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⢁",
               "⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⢐⠘⠗⠷⢙⢐⢐⠠⢁⢂⠱⢕⢗⢃⢂⢂⠂⠌⠌⠺⠸⠜⡂⠌⡐⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⢐",
               "⠡⠡⠡⠡⠡⣡⣱⣧⣡⠡⠁⣷⡃⣲⡆⡂⠌⢌⢴⢼⣺⠨⣪⢪⡲⣰⢁⠂⣗⠅⡕⣕⢕⢦⢸⢸⢸⡲⢰⣳⣵⡷⣵⠡⢑⣿⠌⢸⣺⣞⣾⣺⣞⣾⠌⠌⠌⠌⠌⠌⠌⡐⡐⡐⡐",
               "⠅⠅⠅⠅⠅⡋⣳⣗⢍⢣⢷⣳⢇⢪⣗⠠⢁⠢⣭⢽⣺⠨⣺⢐⠨⣺⢐⠀⣗⠅⡌⣄⣑⢽⢸⢸⢸⡪⢐⢀⣯⣇⡂⣷⢷⣿⠅⡂⡂⡂⡂⡂⠢⣿⠅⠅⠅⠅⠅⠅⠅⡂⡂⡂⡂",
               "⠡⠡⠡⠡⠁⢯⢓⠙⢗⠆⡂⡯⡇⠽⡺⡳⡳⠧⠡⢹⣳⠨⣺⢐⠨⣺⢐⠀⣗⠅⡇⡇⡃⡙⢨⡳⢱⢝⠰⠟⡋⡛⢟⢐⢘⢾⢱⢶⡶⣶⢶⢾⢾⢾⢾⠌⠌⠌⠌⠌⡐⡐⡐⡐⡐",
               "⠡⠡⠡⠡⢁⢂⠂⢌⡶⢷⣲⡐⠠⠑⣼⡆⡂⠅⠅⡑⠫⠨⡺⣔⢜⢼⢐⠀⣗⠅⡇⡧⡢⡆⡆⡯⢸⢕⢈⠺⠾⠾⠾⠾⢾⣾⢂⢢⣷⠷⠷⠷⢷⣷⡂⠌⠌⠌⠌⡐⡐⡐⡐⡐⡐",
               "⠅⠅⠅⠅⡂⡂⠌⡘⢽⢖⠯⠂⠅⠅⠷⡳⡞⠾⡺⢞⠾⠠⢁⠂⠅⠅⡂⡂⢗⠅⠌⠌⠌⠌⡘⠮⠸⢕⢐⠨⠨⠨⠨⠨⢐⢿⢂⠸⡽⡷⢷⢷⠷⢿⠂⠅⠅⠅⠅⡂⡂⡂⡂⡂⡂",
               "⠡⠡⠡⢁⢂⠂⠅⡂⡂⡂⠌⠌⠌⠌⡐⡐⠠⢁⢂⠂⠌⠌⡐⠨⠨⢐⢐⢐⢐⠨⠨⠨⠨⢐⠠⠡⢁⢂⠂⠌⠌⠌⠌⠌⡐⡐⡐⡐⡐⡐⡐⡐⠨⢐⠨⠨⠨⠨⢐⢐⢐⢐⢐⢐⢐"]



# 2. 클래스 변수를 지정한다.
class Deposit_Money_CAL:
    for i in range(len(MONEY)):
        print(MONEY[i])

    print(MONEY[0])
    deposit_money_index = input("│    예금, 적금, 청년도약계좌, 청년미래적금 중 하나를 입력하세요                   │:")
    print(MONEY[10])

    #2.1.1 예금의 경우를 산정한다.
    if deposit_money_index == "예금":
        for i in range(len(DEPOSIT)):
            print(DEPOSIT[i])
        def deposit():
            print(MONEY[0])
            terms = int(input("│    예치 기간을 입력하세요. (개월)                                           │:"))
            print(MONEY[10])
            print(MONEY[0])
            rates = float(input("│    연 이율을 입력하세요.                                                   │:"))/100
            print(MONEY[10])
            print(MONEY[0])
            balance = int(input("│    예치 할 금액을 입력하세요. (만원)                                         │:"))*10000
            print(MONEY[10])
            taxes = float(15.4/100)
            net_income = (balance + (balance*(rates*(terms/12)))) - (balance*(rates*(terms/12)))*taxes

            print(MONEY[0])
            print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
            print(MONEY[10])

            return(net_income)
        deposit()



    #2.1.2 적금의 경우를 산정한다.
    elif deposit_money_index == "적금":
        for i in range(len(DEPOSIT)):
            print(DEPOSIT[i])
        def Saving():
            print(MONEY[0])
            terms = int(input("│    가입 기간을 입력하세요. (개월)                                           │:"))
            print(MONEY[10])
            print(MONEY[0])
            rates = float(input("│    연 이율을 입력하세요. (%)                                               │:"))/100
            print(MONEY[10])
            print(MONEY[0])
            balance = int(input("│    월 납입할 금액을 입력하세요. (만원)                                       │:"))*10000
            print(MONEY[10])

            taxes = float(15.4/100)

            net_income = balance * terms + (balance * (rates / 12) * (terms * (terms + 1) / 2)) * (1 - taxes)

            print(MONEY[0])
            print(    f"적금의 실수령액은 {net_income:,.0f}원입니다.                         ")
            print(MONEY[10])

            return(net_income)
        Saving()
    #2.1.3 청년도약계좌의 경우를 산정한다.
    elif deposit_money_index == "청년도약계좌":
        for a in range(len(YOUTH_ACC)):
            print(YOUTH_ACC[a])
        def YOUTH_ACCOUNT():
            print(MONEY[0])
            age = int(input("│    나이를 입력하세요. (만)                                                 │:"))
            print(MONEY[10])
            if age <= 19 or age >= 34:
                print("│    청년도약계좌 가입이 불가합니다.                                     │:")
                return(age)
            print(MONEY[0])
            income = int(input("│    연 소득을 입력하세요. (만원)                                             │:"))*10000
            print(MONEY[10])
            print(MONEY[0])
            group_count = int(input("│    가구원의 수를 입력하세요                                                 │:"))
            print(MONEY[10])
            print(MONEY[0])
            group_income = int(input("│    월 가구소득을 입력하세요 (만원)                                           │:"))*10000
            print(MONEY[10])
            terms = 60
            print(MONEY[0])
            rates = float(input("│    연 이율을 입력하세요.                                                   │:"))/100
            print(MONEY[10])
            print(MONEY[0])
            balance = int(input("│    월 납입할 금액을 입력하세요 (만원)(천 원 ~ 70만원)                          │:"))*10000
            print(MONEY[10])

            # 2.1.3.1 소득에 따른 정부 기여금을 정한다.
            if income <= 24000000:
                gov_Con = 33000 # 정부기여금 = gov_Con
            elif 24000000 < income <= 36000000:
                gov_Con = 25000
            elif 36000000 < income <= 48000000:
                gov_Con = 20000
            elif 48000000 < income <= 60000000:
                gov_Con = 16000
            elif income > 60000000:
                gov_Con = 0

            # 2.1.3.2 만기 예상 수령액 수식을 입력한다.
            net_income = (balance + gov_Con) * terms + ((balance + gov_Con)*terms) * rates
            # 2.1.3.3 가구원 수에 따른 가입 조건을 확인한다.
            if group_count == 1:
                if group_income >= 6410000:
                    print(MONEY[0])
                    print("│    청년도약계좌 가입이 불가합니다.                                     │:")
                    print(MONEY[10])

                elif group_income < 6410000:
                    print(MONEY[0])
                    print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
                    print(MONEY[10])

            elif group_count == 2:
                if group_income >= 10500000:
                    print(MONEY[0])
                    print("│    청년도약계좌 가입이 불가합니다.                                     │:")
                    print(MONEY[10])

                elif group_income < 10500000:
                    print(MONEY[0])
                    print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
                    print(MONEY[10])

            elif group_count == 3:
                if group_income >= 13400000:
                    print(MONEY[0])
                    print("│    청년도약계좌 가입이 불가합니다.                                     │")
                    print(MONEY[10])

                elif group_income < 13400000:
                    print(MONEY[0])
                    print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
                    print(MONEY[10])

            elif group_count == 4:
                if group_income >= 16240000:
                    print(MONEY[0])
                    print("│    청년도약계좌 가입이 불가합니다.                                     │")
                    print(MONEY[10])

                elif group_income < 162400000:
                    print(MONEY[0])
                    print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
                    print(MONEY[10])

            elif group_count == 5:
                if group_income >= 18890000:
                    print(MONEY[0])
                    print("│    청년도약계좌 가입이 불가합니다.                                     │")
                    print(MONEY[10])

                elif group_income < 188900000:
                    print(MONEY[0])
                    print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
                    print(MONEY[10])

            elif group_count == 6:
                if group_income >= 21390000:
                    print(MONEY[0])
                    print("│    청년도약계좌 가입이 불가합니다.                                     │")
                    print(MONEY[10])

                elif group_income < 213900000:
                    print(MONEY[0])
                    print(    f"예금의 실수령액은 {net_income:,.0f}원입니다.                         ")
                    print(MONEY[10])
        YOUTH_ACCOUNT()

    elif deposit_money_index == "청년미래적금":
        for b in range(len(YOUTH_F_ACC)):
            print(YOUTH_F_ACC[b])
        print("우대형 기준으로 계산됩니다.")
        def YOUTH_F_ACCOUNT():
            print(MONEY[0])
            balance = int(input("│    월 납입 금액을 입력하세요. (만원)(천 원 ~ 50만원)                          │:")) * 10000
            print(MONEY[10])
            print(MONEY[0])
            rates = float(input("│    우대금리를 포함한 금리를 입력하세요.                                       │:")) / 100
            print(MONEY[10])
            net_income = 1.12 * balance * (36 + (rates / 12.0) * (36 * 37 / 2.0))
            print(MONEY[0])
            print("\t"f"예금의 실수령액은 {net_income:,.0f}원입니다.")
            print(MONEY[10])
            return(net_income)

        YOUTH_F_ACCOUNT()

